In [3]:
import pandas as pd

Bài 1:

In [5]:
df = pd.DataFrame({"Id":[1,2,3,4],
                   "Name":["Jeo", "Henry", "Sam", "Max"],
                   "Salary":[70000,80000,60000,90000],
                   "ManagerId":[3,4,None,None]})

In [16]:
df["ManagerId"].fillna(-1, inplace=True)
df

   Id   Name  Salary  ManagerId
0   1    Jeo   70000        3.0
1   2  Henry   80000        4.0
2   3    Sam   60000       -1.0
3   4    Max   90000       -1.0

In [21]:
# Tạo cột mới 'ManagerSalary' để lưu trữ salary của manager tương ứng với mỗi employee
df['ManagerSalary'] = df['ManagerId'].map(df.set_index('Id')['Salary'])

# Hiển thị 5 hàng đầu tiên của bảng đã có cột 'ManagerSalary'
print(df.head())

   Id   Name  Salary  ManagerId  ManagerSalary
0   1    Jeo   70000        3.0        60000.0
1   2  Henry   80000        4.0        90000.0
2   3    Sam   60000       -1.0            NaN
3   4    Max   90000       -1.0            NaN

In [25]:
output = df.loc[df["Salary"] > df["ManagerSalary"]]
output

   Id Name  Salary  ManagerId  ManagerSalary
0   1  Jeo   70000        3.0        60000.0

In [27]:
# liệt kê ra các employee không có manager:
new_df = df.loc[df["ManagerId"] == -1]
new_df.rename(columns={"Name": "Employee"}, inplace = True)
new_df["Employee"].to_frame()

/tmp/ipykernel_41524/3494131740.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df.rename(columns={"Name": "Employee"}, inplace = True)

  Employee
2      Sam
3      Max

Bai 2:

In [31]:
#Đọc file:
employees = pd.read_csv("./HW5/employee_02.csv", header=None, names=["Id", "Name", "Salary", "DepartmentId"])
departments = pd.read_csv("./HW5/department.csv", header=None, names=["Id", "Name"]) 
departments

   Id   Name
0   1     IT
1   2  Sales

In [33]:
# Nhóm các nhân viên theo phòng ban và tính mức lương cao nhất của mỗi nhóm
max_salaries = employees.groupby(['DepartmentId'])['Salary'].max().reset_index()
employee_max_salaries = employees.merge(max_salaries, on=['DepartmentId', 'Salary'], how='inner')
employee_max_salaries

   Id   Name  Salary  DepartmentId
0   2    Jim   90000             1
1   5    Max   90000             1
2   3  Henry   80000             2

In [34]:
# Ghép kết quả với bảng phòng ban
result_23 = pd.merge(employee_max_salaries, departments,left_on='DepartmentId', right_on = "Id")[['Name_y', 'Name_x', "Salary"]]
result_23.columns = ["Department", "Employee", "Salary"]
result_23

  Department Employee  Salary
0         IT      Jim   90000
1         IT      Max   90000
2      Sales    Henry   80000